Repository: Ru51kXD/LanguageCourse
Catalog: Resources/SharedResource.*.resx
Languages: kk, tr

source: Home
kk: Басты бет
tr: Ana Sayfa

source: Courses
kk: Курстар
tr: Kurslar

source: Login
kk: Кіру
tr: Giriş

source: Register
kk: Тіркелу
tr: KAYIT OL

source: My Results
kk: Менің нәтижелерім
tr: Sonuçlarım

source: Profile
kk: Профиль
tr: Profil

source: Logout
kk: Шығу
tr: Çıkış

source: Email
tr: E-posta

source: Password
kk: Құпия сөз
tr: Şifre

source: Tests
kk: Тесттер
tr: TESTLER

# Videos
source: Video Lessons
kk: Бейне сабақтар
tr: Video Dersler

source: Learn Languages With Us
kk: Бізбен бірге тілдерді үйреніңіз
tr: Bizimle Dil Öğrenin

# PlatformDescription
source: Convenient platform for learning Kazakh, English and Turkish languages.
kk: Қазақ, ағылшын және түрік тілдерін үйренуге арналған ыңғайлы платформа.
tr: Platformumuz, interaktif testler, video dersler ve pratik alıştırmalar kullanarak etkili dil öğrenme yöntemleri sunar. Bize katılın ve yabancı dil öğrenme yolculuğunuza bugün başlayın.

source: Start Learning
kk: Оқуды бастау
tr: Öğrenmeye Başla

source: Available Languages
kk: Қол жетімді тілдер
tr: Mevcut Diller

# StudyFromBeginnerToAdvanced
source: Study from beginner to advanced level
kk: Бастауыш деңгейден күрделі деңгейге дейін үйрену
tr: Başlangıçtan ileri seviyeye kadar öğrenin

source: Select Level
kk: Деңгейді таңдау
tr: Seviye Seç

source: Interactive Tests
kk: Интерактивті тесттер
tr: İnteraktif Testler

# TestsDescription
source: Check your knowledge level with our tests. Each test contains a series of questions that will help you consolidate the material you have learned.
kk: Біздің тесттерімізбен білім деңгейіңізді тексеріңіз. Әр тест сіз үйренген материалды бекітуге көмектесетін бірқатар сұрақтардан тұрады.
tr: Testlerimizle bilgi seviyenizi kontrol edin. Her test, öğrendiğiniz materyali pekiştirmenize yardımcı olacak bir dizi soru içerir.

source: Video Lessons
kk: Бейне сабақтар
tr: Video Dersler

# VideosDescription
source: Watch video lessons to improve your skills. Our teachers explain topics in a simple and clear language.
kk: Дағдыларыңызды жақсарту үшін бейне сабақтарды көріңіз. Біздің мұғалімдер тақырыптарды қарапайым және түсінікті тілде түсіндіреді.
tr: Becerilerinizi geliştirmek için video derslerini izleyin. Öğretmenlerimiz konuları basit ve anlaşılır bir dille açıklar.

source: English Language
kk: Ағылшын тілі
tr: İngilizce

source: Kazakh Language
kk: Қазақ тілі
tr: Kazak Dili

source: Turkish Language
kk: Түрік тілі
tr: Türkçe

source: English
kk: Ағылшын
tr: İngilizce

source: Kazakh
kk: Қазақ
tr: Kazakça

source: Turkish
kk: Түрік
tr: Türkçe

# ChooseLanguageToLearn
source: Choose a language to learn
kk: Оқу үшін тілді таңдаңыз
tr: Öğrenmek İstediğiniz Dili Seçin

# EnglishDescription
source: International language of business, technology and cross-cultural communication.
kk: Бизнес, технология және мәдениетаралық қарым-қатынастың халықаралық тілі.
tr: İş, teknoloji ve kültürlerarası iletişimin uluslararası dili.

# KazakhDescription
source: The official language of Kazakhstan with a rich history and culture.
kk: Бай тарихы мен мәдениеті бар Қазақстанның мемлекеттік тілі.
tr: Zengin tarihi ve kültürü olan Kazakistan'ın resmi dili.

# TurkishDescription
source: Language with an ancient history, connecting Europe and Asia.
kk: Еуропа мен Азияны байланыстыратын ежелгі тарихы бар тіл.
tr: Avrupa ve Asya'yı birbirine bağlayan köklü bir geçmişe sahip dil.

source: Learn more
kk: Көбірек білу
tr: Daha Fazla Bilgi

# WhyLearnWithUs
source: Why learn languages with us?
kk: Неге бізбен тілдерді үйрену керек?
tr: Neden Bizimle Dil Öğrenmelisiniz?

source: Interactive Learning
kk: Интерактивті оқыту
tr: İnteraktif Öğrenme

source: Cultural Immersion
kk: Мәдениетке ену
tr: Kültürel Daldırma

# Certification
source: Language Certification
kk: Тіл меңгеру сертификаты
tr: Dil Yeterlilik Sertifikası

# InteractiveLearningDescription
source: Our courses are built on active interaction and practice, making learning effective and engaging.
kk: Біздің курстар белсенді өзара әрекеттесу мен практикаға негізделген, бұл оқуды тиімді және қызықты етеді.
tr: Kurslarımız aktif etkileşim ve pratik üzerine kuruludur, bu da öğrenmeyi etkili ve ilgi çekici hale getirir.

# CulturalImmersionDescription
source: Learn not just the language, but also the culture, traditions and customs to better understand the context.
kk: Тек тілді ғана емес, сонымен қатар елдің мәдениетін, дәстүрлері мен салт-дәстүрлерін контекстті жақсы түсіну үшін үйреніңіз.
tr: Sadece dili değil, aynı zamanda ülkenin kültürünü, geleneklerini ve göreneklerini de öğrenin, bağlamı daha iyi anlamak için.

# CertificationDescription
source: Receive an internationally recognized language proficiency certificate after completing our courses.
kk: Біздің курстарды аяқтағаннан кейін халықаралық үлгідегі тіл меңгеру сертификатын алыңыз.
tr: Kurslarımızı tamamladıktan sonra uluslararası geçerliliği olan bir dil yeterlilik sertifikası alın.

source: Practice
kk: Практика
tr: Pratik

source: Take Tests
kk: Тестілерді өту
tr: Testleri Çöz

source: Personal Account
kk: Жеке кабинет
tr: Kişisel Hesap

# MasterLanguagesDescription
source: Master new languages through our interactive tests and video lessons
kk: Біздің интерактивті тестілер мен бейне сабақтар арқылы жаңа тілдерді меңгеріңіз
tr: İnteraktif testlerimiz ve video derslerimiz ile yeni dilleri öğrenin

# PlatformDetailedDescription
source: Our platform offers effective language learning methodologies using interactive tests, video lessons, and practical exercises. Join us today and begin your journey to fluency in foreign languages.
kk: Біздің платформа интерактивті тесттер, бейне сабақтар және практикалық жаттығулар арқылы тілдерді оқытудың тиімді әдістемелерін ұсынады. Бізге қосылыңыз және бүгіннен бастап шет тілдерін еркін меңгеруге бастар жолыңызды бастаңыз.
tr: Platformumuz, interaktif testler, video dersler ve pratik alıştırmalar kullanarak etkili dil öğrenme metodolojileri sunuyor. Bugün bize katılın ve yabancı dillerde akıcılığa giden yolculuğunuza başlayın.

source: About Us
kk: Біз туралы
tr: Hakkımızda
