Repository: Ru51kXD/LanguageCourse
Catalog: Resources/TestResources.*.resx
Languages: ru

# Level_A1
source: beginner
ru: начальный

# Level_A2
source: elementary
ru: базовый

# Level_B1
source: intermediate
ru: средний

# Level_B2
source: upper-intermediate
ru: выше среднего

# Level_C1
source: advanced
ru: продвинутый

# Level_C2
source: proficient
ru: свободное владение

# Vocabulary_Test_Description
source: Test your knowledge of {0} at {1} level. This test focuses on your vocabulary and basic grammatical structures.
ru: Проверьте свои знания {0} на уровне {1}. Этот тест фокусируется на словарном запасе и базовых грамматических структурах.

# Grammar_Test_Description
source: Extended {0} test at {1} level. Check your knowledge of grammar, idioms, and complex structures.
ru: Расширенный тест по {0} на уровне {1}. Проверьте свои знания грамматики, идиом и сложных конструкций.

# Английский_A1_Vocabulary_Title
source: English Fundamentals Test
ru: Основы английского языка

# Английский_A1_Grammar_Title
source: English Grammar for Beginners
ru: Грамматика английского для начинающих

# Английский_A2_Vocabulary_Title
source: English Language (A2)
ru: Английский язык (A2)

# Английский_A2_Grammar_Title
source: English Tenses
ru: Времена в английском языке

# Английский_B1_Vocabulary_Title
source: Intermediate English (B1)
ru: Английский среднего уровня (B1)

# Английский_B1_Grammar_Title
source: English Idioms and Phrasal Verbs (B1)
ru: Идиомы и фразовые глаголы английского (B1)

# Английский_B2_Vocabulary_Title
source: Upper-Intermediate English (B2)
ru: Английский выше среднего (B2)

# Английский_B2_Grammar_Title
source: Complex Structures in English (B2)
ru: Сложные конструкции в английском (B2)

# Английский_C1_Vocabulary_Title
source: Advanced English (C1)
ru: Продвинутый английский (C1)

# Английский_C1_Grammar_Title
source: Academic English (C1)
ru: Академический английский (C1)

# Английский_C2_Vocabulary_Title
source: Proficient English (C2)
ru: Свободное владение английским (C2)

# Английский_C2_Grammar_Title
source: Literary English (C2)
ru: Литературный английский (C2)

# Казахский_A1_Vocabulary_Title
source: Kazakh Fundamentals Test
ru: Основы казахского языка

# Казахский_A1_Grammar_Title
source: Kazakh - Numbers and Colors
ru: Казахский - числа и цвета

# Казахский_A2_Vocabulary_Title
source: Kazakh for Beginners (A2)
ru: Казахский для начинающих (A2)

# Казахский_A2_Grammar_Title
source: Kazakh Grammar (A2)
ru: Грамматика казахского (A2)

# Казахский_B1_Vocabulary_Title
source: Intermediate Kazakh (B1)
ru: Казахский среднего уровня (B1)

# Казахский_B1_Grammar_Title
source: Kazakh Idioms and Phrases (B1)
ru: Идиомы и фразы казахского (B1)

# Казахский_B2_Vocabulary_Title
source: Upper-Intermediate Kazakh (B2)
ru: Казахский выше среднего (B2)

# Казахский_B2_Grammar_Title
source: Kazakh Literature (B2)
ru: Казахская литература (B2)

# Казахский_C1_Vocabulary_Title
source: Advanced Kazakh (C1)
ru: Продвинутый казахский (C1)

# Казахский_C1_Grammar_Title
source: Business Kazakh (C1)
ru: Деловой казахский (C1)

# Казахский_C2_Vocabulary_Title
source: Proficient Kazakh (C2)
ru: Свободное владение казахским (C2)

# Казахский_C2_Grammar_Title
source: Academic Kazakh (C2)
ru: Академический казахский (C2)

# Турецкий_A1_Vocabulary_Title
source: Turkish Fundamentals Test
ru: Основы турецкого языка

# Турецкий_A1_Grammar_Title
source: Turkish Numbers and Days of the Week
ru: Турецкий - числа и дни недели

# Турецкий_A2_Vocabulary_Title
source: Turkish for Beginners (A2)
ru: Турецкий для начинающих (A2)

# Турецкий_A2_Grammar_Title
source: Turkish Grammar (A2)
ru: Грамматика турецкого (A2)

# Турецкий_B1_Vocabulary_Title
source: Intermediate Turkish (B1)
ru: Турецкий среднего уровня (B1)

# Турецкий_B1_Grammar_Title
source: Turkish Idioms and Phrases (B1)
ru: Идиомы и фразы турецкого (B1)

# Турецкий_B2_Vocabulary_Title
source: Upper-Intermediate Turkish (B2)
ru: Турецкий выше среднего (B2)

# Турецкий_B2_Grammar_Title
source: Turkish Literature (B2)
ru: Турецкая литература (B2)

# Турецкий_C1_Vocabulary_Title
source: Advanced Turkish (C1)
ru: Продвинутый турецкий (C1)

# Турецкий_C1_Grammar_Title
source: Business Turkish (C1)
ru: Деловой турецкий (C1)

# Турецкий_C2_Vocabulary_Title
source: Proficient Turkish (C2)
ru: Свободное владение турецким (C2)

# Турецкий_C2_Grammar_Title
source: Academic Turkish (C2)
ru: Академический турецкий (C2)

# Русский_A1_Vocabulary_Title
source: Russian Fundamentals Test
ru: Основы русского языка

# Русский_A1_Grammar_Title
source: Russian Alphabet and Pronunciation
ru: Русский алфавит и произношение

# Русский_A2_Vocabulary_Title
source: Russian for Beginners (A2)
ru: Русский для начинающих (A2)

# Русский_A2_Grammar_Title
source: Russian Grammar (A2)
ru: Грамматика русского (A2)

# Русский_B1_Vocabulary_Title
source: Intermediate Russian (B1)
ru: Русский среднего уровня (B1)

# Русский_B1_Grammar_Title
source: Russian Idioms and Phrases (B1)
ru: Идиомы и фразы русского (B1)

# Русский_B2_Vocabulary_Title
source: Upper-Intermediate Russian (B2)
ru: Русский выше среднего (B2)

# Русский_B2_Grammar_Title
source: Russian Literature (B2)
ru: Русская литература (B2)

# Русский_C1_Vocabulary_Title
source: Advanced Russian (C1)
ru: Продвинутый русский (C1)

# Русский_C1_Grammar_Title
source: Business Russian (C1)
ru: Деловой русский (C1)

# Русский_C2_Vocabulary_Title
source: Proficient Russian (C2)
ru: Свободное владение русским (C2)

# Русский_C2_Grammar_Title
source: Academic Russian (C2)
ru: Академический русский (C2)
